{
  "info": {
    "firstName": "Trillium",
    "lastName": "Smith",
    "role": "Frontend Software Engineer",
    "email": "Trillium@trilliumsmith.com",
    "phone": "818.738.5344",
    "website": "www.trilliumsmith.com",
    "bluesky": "bsky.app/profile/trillium.is",
    "linkedIn": "www.linkedin.com/in/trilliumsmith/",
    "github": "www.github.com/trillium/"
  },
  "header": {
    "name": "Trillium Smith",
    "resume": [
      "Frontend developer focused on creating seamless user experiences and scalable systems. Passionate about accessibility and modern web technologies."
    ],
    "title": [
      "Software Developer"
    ]
  },
  "workExperience": [
    {
      "position": "Lead Frontend Engineer",
      "company": "HackForLA",
      "location": "Los Angeles, CA",
      "icon": "Remote",
      "years": "Oct 2022 - Present",
      "lines": [
        {
          "text": "Led the migration to modern front-end frameworks, improving performance and scalability for high-traffic applications using React.js, including Hooks and Context API."
        },
        {
          "text": "Collaborated with cross-functional teams, including designers using Figma, to design and implement reusable UI components, ensuring consistency and accessibility across projects."
        },
        {
          "text": "Built and consumed RESTful APIs, integrating with SQL (PostgreSQL) and NoSQL (MongoDB) databases to support scalable data handling."
        },
        {
          "text": "Enhanced team collaboration by introducing code quality tools (linting, reviews, shared configs) and supporting remote onboarding workflows."
        },
        {
          "text": "Modernized the stack with React, Vite, and Vitest; implemented testing strategies using Jest and Cypress to ensure maintainability."
        }
      ]
    },
    {
      "position": "Frontend Engineer",
      "company": "TS Consulting",
      "location": "Los Angeles, CA",
      "icon": "Remote",
      "years": "Jul 2021 - Present",
      "lines": [
        {
          "text": "Developed and optimized front-end systems for diverse clients, focusing on performance, user experience, and accessibility."
        },
        {
          "text": "Diagnosed and resolved layout, CSS, and plugin issues in custom WordPress themes inherited from prior developers, restoring site functionality and improving visual consistency for small business clients."
        },
        {
          "text": "Built and consumed RESTful APIs to integrate front-end systems with NoSQL databases (MongoDB), ensuring scalable and efficient data handling."
        },
        {
          "text": "Addressed UX and layout issues for a legacy PHP coaching platform, improving site usability and content delivery for end users."
        },
        {
          "text": "Introduced testing strategies using Jest and Cypress to ensure high code quality and maintainability."
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "Flossy",
      "lines": [
        {
          "text": "Translated client vision into a fully responsive, production-ready website."
        },
        {
          "text": "Collaborated closely with clients during revisions, translating feedback into precise UI changes without compromising UX or responsive behavior."
        }
      ],
      "links": [
        {
          "name": "Live Site",
          "icon": "None",
          "link": "flossy.com"
        }
      ]
    },
    {
      "name": "Massage Therapy Booking Application",
      "lines": [
        {
          "text": "Built a serverless booking app with Next.js, Tailwind, TypeScript, Redux, and Google Calendar integration."
        },
        {
          "text": "Designed around real-world constraints for solo practitioners and flexible appointment management."
        }
      ],
      "links": [
        {
          "name": "GitHub",
          "icon": "None",
          "link": "github.com/trillium/massage"
        },
        {
          "name": "Live Site",
          "icon": "None",
          "link": "trilliummassage.la/?utm_source=openai&utm_medium=referral&utm_campaign=frontend_engineer_intuit"
        }
      ]
    },
    {
      "name": "Talon Voice Hands-Free Accessibility Suite",
      "lines": [
        {
          "text": "Configured Talon Voice, a Python-based accessibility system, for hands-free coding and navigation for developers with limitations."
        },
        {
          "text": "Developed scripts to extend Talon Voice functionality, improving workflow efficiency and accessibility for voice-driven coding."
        },
        {
          "text": "Shared configurations and best practices with the Talon Voice community to enhance Python-based voice automation."
        },
        {
          "text": "Advocated for tech accessibility by demonstrating Talon Voice integrations at events and through public speaking."
        }
      ]
    },
    {
      "name": "Voice Accessibility Speaking",
      "lines": [
        {
          "text": "Presented a live demo of voice-driven development with Talon Voice and open-source tools like Cursorless, focusing on accessibility and sustainable workflows."
        },
        {
          "text": "Advocated for accessibility in tech through public speaking, live demos, and community education on voice-driven development."
        }
      ],
      "links": [
        {
          "name": "Video Link",
          "icon": "None",
          "link": "trillium.is/voice_tools_talk_2025_05"
        }
      ]
    }
  ],
  "profile": {
    "shouldDisplayProfileImage": false,
    "lines": [
      "Los Angeles, CA",
      "(818) 738 - 5344",
      "trillium@trilliumsmith.com"
    ],
    "links": [
      {
        "name": "linkedin.com/in/trilliumsmith/",
        "icon": "LinkedIn",
        "link": "linkedin.com/in/trilliumsmith/"
      },
      {
        "name": "github.com/trillium",
        "icon": "GitHub",
        "link": "github.com/trillium"
      },
      {
        "name": "trilliumsmith.com",
        "icon": "Website",
        "link": "trilliumsmith.com"
      },
      {
        "name": "bsky.app/profile/trillium.is",
        "icon": "Bluesky",
        "link": "bsky.app/profile/trillium.is"
      }
    ]
  },
  "coverLetter": [
    "Dear Hiring team,",
    null,
    "Omitted",
    null,
    "Sincerely,",
    "Trillium Smith"
  ],
  "careerSummary": [
    {
      "title": "Experience",
      "text": "4+ years building and owning production web applications with a focus on front-end technologies, accessibility, and developer experience. Specialized in creating scalable, efficient, and user-friendly systems for high-traffic platforms."
    },
    {
      "title": "Skills and Languages",
      "text": "Expertise in building fast, accessible, and intuitive web applications using React, TypeScript, and Next.js. Skilled in collaborating with cross-functional teams to deliver high-quality, scalable solutions. Proficient in JavaScript, TypeScript, Python, HTML, and CSS."
    }
  ]
}